aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint32_t rpl_rftxup_dly0_get(void)
{
    return REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);
}

__INLINE void rpl_rftxup_dly0_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR, value);
}

// field definitions
#define RPL_TX_UP_DLY2_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_UP_DLY2_LSB    22
#define RPL_TX_UP_DLY2_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY1_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_UP_DLY1_LSB    11
#define RPL_TX_UP_DLY1_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY0_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_UP_DLY0_LSB    0
#define RPL_TX_UP_DLY0_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_UP_DLY2_RST    0x19
#define RPL_TX_UP_DLY1_RST    0x206
#define RPL_TX_UP_DLY0_RST    0x1

__INLINE void rpl_rftxup_dly0_pack(uint16_t txupdly2, uint16_t txupdly1, uint16_t txupdly0)
{
    ASSERT_ERR((((uint32_t)txupdly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupdly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupdly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR,  ((uint32_t)txupdly2 << 22) | ((uint32_t)txupdly1 << 11) | ((uint32_t)txupdly0 << 0));
}

__INLINE void rpl_rftxup_dly0_unpack(uint16_t* txupdly2, uint16_t* txupdly1, uint16_t* txupdly0)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);

    *txupdly2 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txupdly1 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txupdly0 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rpl_tx_up_dly2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__INLINE void rpl_tx_up_dly2_setf(uint16_t txupdly2)
{
    ASSERT_ERR((((uint32_t)txupdly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txupdly2 << 22));
}

__INLINE uint16_t rpl_tx_up_dly1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__INLINE void rpl_tx_up_dly1_setf(uint16_t txupdly1)
{
    ASSERT_ERR((((uint32_t)txupdly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txupdly1 << 11));
}

__INLINE uint16_t rpl_tx_up_dly0_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rpl_tx_up_dly0_setf(uint16_t txupdly0)
{
    ASSERT_ERR((((uint32_t)txupdly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY0_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txupdly0 << 0));
}

/**
 * @brief RFTXUP_DLY1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_UP_DLY5   0x1
 *  20:11           TX_UP_DLY4   0x1
 *  09:00           TX_UP_DLY3   0x19
 * </pre>
 */
#define RPL_RFTXUP_DLY1_ADDR   0x00000004
#define RPL_RFTXUP_DLY1_OFFSET 0x00000004
#define RPL_RFTXUP_DLY1_INDEX  0x00000004
#define RPL_RFTXUP_DLY1_RESET  0x00400819

__INLINE uint32_t rpl_rftxup_dly1_get(void)
{
    return REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);
}

__INLINE void rpl_rftxup_dly1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR, value);
}

// field definitions
#define RPL_TX_UP_DLY5_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_UP_DLY5_LSB    22
#define RPL_TX_UP_DLY5_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY4_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_UP_DLY4_LSB    11
#define RPL_TX_UP_DLY4_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_UP_DLY3_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_UP_DLY3_LSB    0
#define RPL_TX_UP_DLY3_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_UP_DLY5_RST    0x1
#define RPL_TX_UP_DLY4_RST    0x1
#define RPL_TX_UP_DLY3_RST    0x19

__INLINE void rpl_rftxup_dly1_pack(uint16_t txupdly5, uint16_t txupdly4, uint16_t txupdly3)
{
    ASSERT_ERR((((uint32_t)txupdly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupdly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupdly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR,  ((uint32_t)txupdly5 << 22) | ((uint32_t)txupdly4 << 11) | ((uint32_t)txupdly3 << 0));
}

__INLINE void rpl_rftxup_dly1_unpack(uint16_t* txupdly5, uint16_t* txupdly4, uint16_t* txupdly3)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);

    *txupdly5 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txupdly4 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txupdly3 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rpl_tx_up_dly5_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__INLINE void rpl_tx_up_dly5_setf(uint16_t txupdly5)
{
    ASSERT_ERR((((uint32_t)txupdly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txupdly5 << 22));
}

__INLINE uint16_t rpl_tx_up_dly4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__INLINE void rpl_tx_up_dly4_setf(uint16_t txupdly4)
{
    ASSERT_ERR((((uint32_t)txupdly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txupdly4 << 11));
}

__INLINE uint16_t rpl_tx_up_dly3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rpl_tx_up_dly3_setf(uint16_t txupdly3)
{
    ASSERT_ERR((((uint32_t)txupdly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXUP_DLY1_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txupdly3 << 0));
}

/**
 * @brief RFTXUP_DLY2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_UP_DLY8   0x1
 *  20:11           TX_UP_DLY7   0x1
 *  09:00           TX_UP_DLY6   0x1
 * </pre>
 */
#define RPL_RFTXUP_DLY2_ADDR   0x00000005
#define RPL_RFTXUP_DLY2_OFFSET 0x00000005
#define RPL_RFTXUP_DLY2_INDEX  0x00000005
#define RPL_RFTXUP_DLY2_RESET  0x00400801

__INLINE uint32_t rpl_rftxup_dly2_get(void)
{
    return REG_RPL_RD(RPL_RFTXUP_DLY2_ADDR);
}

__INLINE void rpl_rftxup_dly2_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXUP_DLY2_ADDR, value);
}

