aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
// field definitions
#define RPL_RX_UP_DLY2_MASK   ((uint32_t)0xFFC00000)
#define RPL_RX_UP_DLY2_LSB    22
#define RPL_RX_UP_DLY2_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_UP_DLY1_MASK   ((uint32_t)0x001FF800)
#define RPL_RX_UP_DLY1_LSB    11
#define RPL_RX_UP_DLY1_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_UP_DLY0_MASK   ((uint32_t)0x000003FF)
#define RPL_RX_UP_DLY0_LSB    0
#define RPL_RX_UP_DLY0_WIDTH  ((uint32_t)0x0000000A)

#define RPL_RX_UP_DLY2_RST    0x19
#define RPL_RX_UP_DLY1_RST    0x206
#define RPL_RX_UP_DLY0_RST    0x1

__INLINE void rpl_rfrxup_dly0_pack(uint16_t rxupdly2, uint16_t rxupdly1, uint16_t rxupdly0)
{
    ASSERT_ERR((((uint32_t)rxupdly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxupdly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxupdly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY0_ADDR,  ((uint32_t)rxupdly2 << 22) | ((uint32_t)rxupdly1 << 11) | ((uint32_t)rxupdly0 << 0));
}

__INLINE void rpl_rfrxup_dly0_unpack(uint16_t* rxupdly2, uint16_t* rxupdly1, uint16_t* rxupdly0)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY0_ADDR);

    *rxupdly2 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *rxupdly1 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *rxupdly0 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rpl_rx_up_dly2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__INLINE void rpl_rx_up_dly2_setf(uint16_t rxupdly2)
{
    ASSERT_ERR((((uint32_t)rxupdly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY0_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)rxupdly2 << 22));
}

__INLINE uint16_t rpl_rx_up_dly1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__INLINE void rpl_rx_up_dly1_setf(uint16_t rxupdly1)
{
    ASSERT_ERR((((uint32_t)rxupdly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY0_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)rxupdly1 << 11));
}

__INLINE uint16_t rpl_rx_up_dly0_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rpl_rx_up_dly0_setf(uint16_t rxupdly0)
{
    ASSERT_ERR((((uint32_t)rxupdly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY0_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY0_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)rxupdly0 << 0));
}

/**
 * @brief RFRXUP_DLY1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           RX_UP_DLY5   0x1
 *  20:11           RX_UP_DLY4   0x1
 *  09:00           RX_UP_DLY3   0x19
 * </pre>
 */
#define RPL_RFRXUP_DLY1_ADDR   0x0000000A
#define RPL_RFRXUP_DLY1_OFFSET 0x0000000A
#define RPL_RFRXUP_DLY1_INDEX  0x0000000A
#define RPL_RFRXUP_DLY1_RESET  0x00400819

__INLINE uint32_t rpl_rfrxup_dly1_get(void)
{
    return REG_RPL_RD(RPL_RFRXUP_DLY1_ADDR);
}

__INLINE void rpl_rfrxup_dly1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFRXUP_DLY1_ADDR, value);
}

// field definitions
#define RPL_RX_UP_DLY5_MASK   ((uint32_t)0xFFC00000)
#define RPL_RX_UP_DLY5_LSB    22
#define RPL_RX_UP_DLY5_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_UP_DLY4_MASK   ((uint32_t)0x001FF800)
#define RPL_RX_UP_DLY4_LSB    11
#define RPL_RX_UP_DLY4_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_UP_DLY3_MASK   ((uint32_t)0x000003FF)
#define RPL_RX_UP_DLY3_LSB    0
#define RPL_RX_UP_DLY3_WIDTH  ((uint32_t)0x0000000A)

#define RPL_RX_UP_DLY5_RST    0x1
#define RPL_RX_UP_DLY4_RST    0x1
#define RPL_RX_UP_DLY3_RST    0x19

__INLINE void rpl_rfrxup_dly1_pack(uint16_t rxupdly5, uint16_t rxupdly4, uint16_t rxupdly3)
{
    ASSERT_ERR((((uint32_t)rxupdly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxupdly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxupdly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY1_ADDR,  ((uint32_t)rxupdly5 << 22) | ((uint32_t)rxupdly4 << 11) | ((uint32_t)rxupdly3 << 0));
}

__INLINE void rpl_rfrxup_dly1_unpack(uint16_t* rxupdly5, uint16_t* rxupdly4, uint16_t* rxupdly3)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY1_ADDR);

    *rxupdly5 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *rxupdly4 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *rxupdly3 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t rpl_rx_up_dly5_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__INLINE void rpl_rx_up_dly5_setf(uint16_t rxupdly5)
{
    ASSERT_ERR((((uint32_t)rxupdly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY1_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)rxupdly5 << 22));
}

__INLINE uint16_t rpl_rx_up_dly4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__INLINE void rpl_rx_up_dly4_setf(uint16_t rxupdly4)
{
    ASSERT_ERR((((uint32_t)rxupdly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY1_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)rxupdly4 << 11));
}

__INLINE uint16_t rpl_rx_up_dly3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void rpl_rx_up_dly3_setf(uint16_t rxupdly3)
{
    ASSERT_ERR((((uint32_t)rxupdly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY1_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY1_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)rxupdly3 << 0));
}

/**
 * @brief RFRXUP_DLY2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           RX_UP_DLY8   0x1
 *  20:11           RX_UP_DLY7   0x1
 *  09:00           RX_UP_DLY6   0x1
 * </pre>
 */
#define RPL_RFRXUP_DLY2_ADDR   0x0000000B
#define RPL_RFRXUP_DLY2_OFFSET 0x0000000B
#define RPL_RFRXUP_DLY2_INDEX  0x0000000B
#define RPL_RFRXUP_DLY2_RESET  0x00400801

__INLINE uint32_t rpl_rfrxup_dly2_get(void)
{
    return REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR);
}

