aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
// field definitions
#define RPL_MASH_SDI4_MASK   ((uint32_t)0xFF000000)
#define RPL_MASH_SDI4_LSB    24
#define RPL_MASH_SDI4_WIDTH  ((uint32_t)0x00000008)
#define RPL_MASH_SDI3_MASK   ((uint32_t)0x00FF0000)
#define RPL_MASH_SDI3_LSB    16
#define RPL_MASH_SDI3_WIDTH  ((uint32_t)0x00000008)
#define RPL_MASH_SDI2_MASK   ((uint32_t)0x0000FF00)
#define RPL_MASH_SDI2_LSB    8
#define RPL_MASH_SDI2_WIDTH  ((uint32_t)0x00000008)
#define RPL_MASH_SDI1_MASK   ((uint32_t)0x000000FF)
#define RPL_MASH_SDI1_LSB    0
#define RPL_MASH_SDI1_WIDTH  ((uint32_t)0x00000008)

#define RPL_MASH_SDI4_RST    0xD
#define RPL_MASH_SDI3_RST    0xB
#define RPL_MASH_SDI2_RST    0x13
#define RPL_MASH_SDI1_RST    0x11

__INLINE void rpl_rpllmash_init_pack(uint8_t mashsdi4, uint8_t mashsdi3, uint8_t mashsdi2, uint8_t mashsdi1)
{
    ASSERT_ERR((((uint32_t)mashsdi4 << 24) & ~((uint32_t)0xFF000000)) == 0);
    ASSERT_ERR((((uint32_t)mashsdi3 << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)mashsdi2 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)mashsdi1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR,  ((uint32_t)mashsdi4 << 24) | ((uint32_t)mashsdi3 << 16) | ((uint32_t)mashsdi2 << 8) | ((uint32_t)mashsdi1 << 0));
}

__INLINE void rpl_rpllmash_init_unpack(uint8_t* mashsdi4, uint8_t* mashsdi3, uint8_t* mashsdi2, uint8_t* mashsdi1)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);

    *mashsdi4 = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *mashsdi3 = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *mashsdi2 = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *mashsdi1 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rpl_mash_sdi4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__INLINE void rpl_mash_sdi4_setf(uint8_t mashsdi4)
{
    ASSERT_ERR((((uint32_t)mashsdi4 << 24) & ~((uint32_t)0xFF000000)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, (REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR) & ~((uint32_t)0xFF000000)) | ((uint32_t)mashsdi4 << 24));
}

__INLINE uint8_t rpl_mash_sdi3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rpl_mash_sdi3_setf(uint8_t mashsdi3)
{
    ASSERT_ERR((((uint32_t)mashsdi3 << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, (REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)mashsdi3 << 16));
}

__INLINE uint8_t rpl_mash_sdi2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE void rpl_mash_sdi2_setf(uint8_t mashsdi2)
{
    ASSERT_ERR((((uint32_t)mashsdi2 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, (REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)mashsdi2 << 8));
}

__INLINE uint8_t rpl_mash_sdi1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_mash_sdi1_setf(uint8_t mashsdi1)
{
    ASSERT_ERR((((uint32_t)mashsdi1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, (REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)mashsdi1 << 0));
}

/**
 * @brief GFSK_FILT_COEFF register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00           FILT_COEFF   0x543C1702
 * </pre>
 */
#define RPL_GFSK_FILT_COEFF_ADDR   0x00000025
#define RPL_GFSK_FILT_COEFF_OFFSET 0x00000025
#define RPL_GFSK_FILT_COEFF_INDEX  0x00000025
#define RPL_GFSK_FILT_COEFF_RESET  0x543C1702
#define RPL_GFSK_FILT_COEFF_COUNT  13

__INLINE uint32_t rpl_gfsk_filt_coeff_get(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 12);
    return REG_RPL_RD(RPL_GFSK_FILT_COEFF_ADDR + reg_idx * 1);
}

__INLINE void rpl_gfsk_filt_coeff_set(int reg_idx, uint32_t value)
{
    ASSERT_ERR(reg_idx <= 12);
    REG_RPL_WR(RPL_GFSK_FILT_COEFF_ADDR + reg_idx * 1, value);
}

// field definitions
#define RPL_FILT_COEFF_MASK   ((uint32_t)0xFFFFFFFF)
#define RPL_FILT_COEFF_LSB    0
#define RPL_FILT_COEFF_WIDTH  ((uint32_t)0x00000020)

#define RPL_FILT_COEFF_RST    0x543C1702

__INLINE uint32_t rpl_filt_coeff_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 12);
    uint32_t localVal = REG_RPL_RD(RPL_GFSK_FILT_COEFF_ADDR + reg_idx * 1);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rpl_filt_coeff_setf(int reg_idx, uint32_t filtcoeff)
{
    ASSERT_ERR(reg_idx <= 12);
    ASSERT_ERR((((uint32_t)filtcoeff << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_RPL_WR(RPL_GFSK_FILT_COEFF_ADDR + reg_idx * 1, (uint32_t)filtcoeff << 0);
}

/**
 * @brief DPLLCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31      FORCE_DPLL_CTRL   0
 *     03           DPLL_LD_ON   0
 *     02          DPLL_VCOMMON_ON   0
 *     01           DPLL_CP_ON   0
 * </pre>
 */
#define RPL_DPLLCNTL0_ADDR   0x00000032
#define RPL_DPLLCNTL0_OFFSET 0x00000032
#define RPL_DPLLCNTL0_INDEX  0x00000032
#define RPL_DPLLCNTL0_RESET  0x00000000

__INLINE uint32_t rpl_dpllcntl0_get(void)
{
    return REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
}

__INLINE void rpl_dpllcntl0_set(uint32_t value)
{
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, value);
}

// field definitions
#define RPL_FORCE_DPLL_CTRL_BIT    ((uint32_t)0x80000000)
#define RPL_FORCE_DPLL_CTRL_POS    31
#define RPL_DPLL_LD_ON_BIT         ((uint32_t)0x00000008)
#define RPL_DPLL_LD_ON_POS         3
#define RPL_DPLL_VCOMMON_ON_BIT        ((uint32_t)0x00000004)
#define RPL_DPLL_VCOMMON_ON_POS        2
#define RPL_DPLL_CP_ON_BIT         ((uint32_t)0x00000002)
#define RPL_DPLL_CP_ON_POS         1

#define RPL_FORCE_DPLL_CTRL_RST    0x0
#define RPL_DPLL_LD_ON_RST         0x0
#define RPL_DPLL_VCOMMON_ON_RST        0x0
#define RPL_DPLL_CP_ON_RST         0x0

__INLINE void rpl_dpllcntl0_pack(uint8_t forcedpllctrl, uint8_t dpllldon, uint8_t dpllvcoon, uint8_t dpllcpon)
{
    ASSERT_ERR((((uint32_t)forcedpllctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)dpllldon << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)dpllvcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dpllcpon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR,  ((uint32_t)forcedpllctrl << 31) | ((uint32_t)dpllldon << 3) | ((uint32_t)dpllvcoon << 2) | ((uint32_t)dpllcpon << 1));
}

