aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint8_t rpl_rpll_rccal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE uint16_t rpl_dpll_rccal_btunestat_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00003FF0)) >> 4);
}

__INLINE uint8_t rpl_dpll_rccal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PLL_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief FILTER_RC_CALIB_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  13:04   FILT_RCCAL_BTUNESTAT   0x0
 *     00      FILT_RCCAL_DONE   0
 * </pre>
 */
#define RPL_FILTER_RC_CALIB_STAT_ADDR   0x00000039
#define RPL_FILTER_RC_CALIB_STAT_OFFSET 0x00000039
#define RPL_FILTER_RC_CALIB_STAT_INDEX  0x00000039
#define RPL_FILTER_RC_CALIB_STAT_RESET  0x00000000

__INLINE uint32_t rpl_filter_rc_calib_stat_get(void)
{
    return REG_RPL_RD(RPL_FILTER_RC_CALIB_STAT_ADDR);
}

// field definitions
#define RPL_FILT_RCCAL_BTUNESTAT_MASK   ((uint32_t)0x00003FF0)
#define RPL_FILT_RCCAL_BTUNESTAT_LSB    4
#define RPL_FILT_RCCAL_BTUNESTAT_WIDTH  ((uint32_t)0x0000000A)
#define RPL_FILT_RCCAL_DONE_BIT         ((uint32_t)0x00000001)
#define RPL_FILT_RCCAL_DONE_POS         0

#define RPL_FILT_RCCAL_BTUNESTAT_RST    0x0
#define RPL_FILT_RCCAL_DONE_RST         0x0

__INLINE void rpl_filter_rc_calib_stat_unpack(uint16_t* filtrccalbtunestat, uint8_t* filtrccaldone)
{
    uint32_t localVal = REG_RPL_RD(RPL_FILTER_RC_CALIB_STAT_ADDR);

    *filtrccalbtunestat = (localVal & ((uint32_t)0x00003FF0)) >> 4;
    *filtrccaldone = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint16_t rpl_filt_rccal_btunestat_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_FILTER_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00003FF0)) >> 4);
}

__INLINE uint8_t rpl_filt_rccal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_FILTER_RC_CALIB_STAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief VCOFC_ICP_CALIBCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     16            LUT_LD_IN   0
 *  15:12           LUT_ICP_IN   0x0
 *  11:08         LUT_VCOFC_IN   0x0
 *     07    LUT_VCOFC_ICP_WEN   0
 *  06:00    LUT_VCOFC_ICP_ADD   0x0
 * </pre>
 */
#define RPL_VCOFC_ICP_CALIBCNTL_ADDR   0x0000003A
#define RPL_VCOFC_ICP_CALIBCNTL_OFFSET 0x0000003A
#define RPL_VCOFC_ICP_CALIBCNTL_INDEX  0x0000003A
#define RPL_VCOFC_ICP_CALIBCNTL_RESET  0x00000000

__INLINE uint32_t rpl_vcofc_icp_calibcntl_get(void)
{
    return REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR);
}

__INLINE void rpl_vcofc_icp_calibcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCNTL_ADDR, value);
}

// field definitions
#define RPL_LUT_LD_IN_BIT            ((uint32_t)0x00010000)
#define RPL_LUT_LD_IN_POS            16
#define RPL_LUT_ICP_IN_MASK          ((uint32_t)0x0000F000)
#define RPL_LUT_ICP_IN_LSB           12
#define RPL_LUT_ICP_IN_WIDTH         ((uint32_t)0x00000004)
#define RPL_LUT_VCOFC_IN_MASK        ((uint32_t)0x00000F00)
#define RPL_LUT_VCOFC_IN_LSB         8
#define RPL_LUT_VCOFC_IN_WIDTH       ((uint32_t)0x00000004)
#define RPL_LUT_VCOFC_ICP_WEN_BIT    ((uint32_t)0x00000080)
#define RPL_LUT_VCOFC_ICP_WEN_POS    7
#define RPL_LUT_VCOFC_ICP_ADD_MASK   ((uint32_t)0x0000007F)
#define RPL_LUT_VCOFC_ICP_ADD_LSB    0
#define RPL_LUT_VCOFC_ICP_ADD_WIDTH  ((uint32_t)0x00000007)

#define RPL_LUT_LD_IN_RST            0x0
#define RPL_LUT_ICP_IN_RST           0x0
#define RPL_LUT_VCOFC_IN_RST         0x0
#define RPL_LUT_VCOFC_ICP_WEN_RST    0x0
#define RPL_LUT_VCOFC_ICP_ADD_RST    0x0

__INLINE void rpl_vcofc_icp_calibcntl_pack(uint8_t lutldin, uint8_t luticpin, uint8_t lutvcofcin, uint8_t lutvcofcicpwen, uint8_t lutvcofcicpadd)
{
    ASSERT_ERR((((uint32_t)lutldin << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)luticpin << 12) & ~((uint32_t)0x0000F000)) == 0);
    ASSERT_ERR((((uint32_t)lutvcofcin << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)lutvcofcicpwen << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)lutvcofcicpadd << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCNTL_ADDR,  ((uint32_t)lutldin << 16) | ((uint32_t)luticpin << 12) | ((uint32_t)lutvcofcin << 8) | ((uint32_t)lutvcofcicpwen << 7) | ((uint32_t)lutvcofcicpadd << 0));
}

__INLINE void rpl_vcofc_icp_calibcntl_unpack(uint8_t* lutldin, uint8_t* luticpin, uint8_t* lutvcofcin, uint8_t* lutvcofcicpwen, uint8_t* lutvcofcicpadd)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR);

    *lutldin = (localVal & ((uint32_t)0x00010000)) >> 16;
    *luticpin = (localVal & ((uint32_t)0x0000F000)) >> 12;
    *lutvcofcin = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *lutvcofcicpwen = (localVal & ((uint32_t)0x00000080)) >> 7;
    *lutvcofcicpadd = (localVal & ((uint32_t)0x0000007F)) >> 0;
}

__INLINE uint8_t rpl_lut_ld_in_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void rpl_lut_ld_in_setf(uint8_t lutldin)
{
    ASSERT_ERR((((uint32_t)lutldin << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)lutldin << 16));
}

__INLINE uint8_t rpl_lut_icp_in_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000F000)) >> 12);
}

__INLINE void rpl_lut_icp_in_setf(uint8_t luticpin)
{
    ASSERT_ERR((((uint32_t)luticpin << 12) & ~((uint32_t)0x0000F000)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR) & ~((uint32_t)0x0000F000)) | ((uint32_t)luticpin << 12));
}

__INLINE uint8_t rpl_lut_vcofc_in_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__INLINE void rpl_lut_vcofc_in_setf(uint8_t lutvcofcin)
{
    ASSERT_ERR((((uint32_t)lutvcofcin << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCNTL_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)lutvcofcin << 8));
}

__INLINE uint8_t rpl_lut_vcofc_icp_wen_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

