aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint8_t rpl_rssi_preload_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0001F000)) >> 12);
}

__INLINE void rpl_rssi_preload_cnt_setf(uint8_t rssipreloadcnt)
{
    ASSERT_ERR((((uint32_t)rssipreloadcnt << 12) & ~((uint32_t)0x0001F000)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, (REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR) & ~((uint32_t)0x0001F000)) | ((uint32_t)rssipreloadcnt << 12));
}

__INLINE uint8_t rpl_rssi_on_dlyd_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__INLINE void rpl_rssi_on_dlyd_cnt_setf(uint8_t rssiondlydcnt)
{
    ASSERT_ERR((((uint32_t)rssiondlydcnt << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, (REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)rssiondlydcnt << 8));
}

__INLINE uint8_t rpl_agc_settle_time_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_agc_settle_time_setf(uint8_t agcsettletime)
{
    ASSERT_ERR((((uint32_t)agcsettletime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_AGC_RSSI_CONFIG_ADDR, (REG_RPL_RD(RPL_AGC_RSSI_CONFIG_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)agcsettletime << 0));
}

/**
 * @brief AGC_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  02:00           AGC_RXGAIN   0x0
 * </pre>
 */
#define RPL_AGC_STAT_ADDR   0x00000040
#define RPL_AGC_STAT_OFFSET 0x00000040
#define RPL_AGC_STAT_INDEX  0x00000040
#define RPL_AGC_STAT_RESET  0x00000000

__INLINE uint32_t rpl_agc_stat_get(void)
{
    return REG_RPL_RD(RPL_AGC_STAT_ADDR);
}

// field definitions
#define RPL_AGC_RXGAIN_MASK   ((uint32_t)0x00000007)
#define RPL_AGC_RXGAIN_LSB    0
#define RPL_AGC_RXGAIN_WIDTH  ((uint32_t)0x00000003)

#define RPL_AGC_RXGAIN_RST    0x0

__INLINE uint8_t rpl_agc_rxgain_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_AGC_STAT_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000007)) == 0);
    return (localVal >> 0);
}

/**
 * @brief RFRXGAINTABLE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:08           RXLNA_GAIN   0x3
 *  05:04           RXMIX_GAIN   0x3
 *  02:00        RXFILTER_GAIN   0x7
 * </pre>
 */
#define RPL_RFRXGAINTABLE_ADDR   0x00000041
#define RPL_RFRXGAINTABLE_OFFSET 0x00000041
#define RPL_RFRXGAINTABLE_INDEX  0x00000041
#define RPL_RFRXGAINTABLE_RESET  0x00000337
#define RPL_RFRXGAINTABLE_COUNT  7

__INLINE uint32_t rpl_rfrxgaintable_get(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 6);
    return REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);
}

__INLINE void rpl_rfrxgaintable_set(int reg_idx, uint32_t value)
{
    ASSERT_ERR(reg_idx <= 6);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1, value);
}

// field definitions
#define RPL_RXLNA_GAIN_MASK      ((uint32_t)0x00000300)
#define RPL_RXLNA_GAIN_LSB       8
#define RPL_RXLNA_GAIN_WIDTH     ((uint32_t)0x00000002)
#define RPL_RXMIX_GAIN_MASK      ((uint32_t)0x00000030)
#define RPL_RXMIX_GAIN_LSB       4
#define RPL_RXMIX_GAIN_WIDTH     ((uint32_t)0x00000002)
#define RPL_RXFILTER_GAIN_MASK   ((uint32_t)0x00000007)
#define RPL_RXFILTER_GAIN_LSB    0
#define RPL_RXFILTER_GAIN_WIDTH  ((uint32_t)0x00000003)

#define RPL_RXLNA_GAIN_RST       0x3
#define RPL_RXMIX_GAIN_RST       0x3
#define RPL_RXFILTER_GAIN_RST    0x7

__INLINE void rpl_rfrxgaintable_pack(int reg_idx, uint8_t rxlnagain, uint8_t rxmixgain, uint8_t rxfiltergain)
{
    ASSERT_ERR(reg_idx <= 6);
    ASSERT_ERR((((uint32_t)rxlnagain << 8) & ~((uint32_t)0x00000300)) == 0);
    ASSERT_ERR((((uint32_t)rxmixgain << 4) & ~((uint32_t)0x00000030)) == 0);
    ASSERT_ERR((((uint32_t)rxfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1,  ((uint32_t)rxlnagain << 8) | ((uint32_t)rxmixgain << 4) | ((uint32_t)rxfiltergain << 0));
}

__INLINE void rpl_rfrxgaintable_unpack(int reg_idx, uint8_t* rxlnagain, uint8_t* rxmixgain, uint8_t* rxfiltergain)
{
    ASSERT_ERR(reg_idx <= 6);
    uint32_t localVal = REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);

    *rxlnagain = (localVal & ((uint32_t)0x00000300)) >> 8;
    *rxmixgain = (localVal & ((uint32_t)0x00000030)) >> 4;
    *rxfiltergain = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__INLINE uint8_t rpl_rxlna_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 6);
    uint32_t localVal = REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000300)) >> 8);
}

__INLINE void rpl_rxlna_gain_setf(int reg_idx, uint8_t rxlnagain)
{
    ASSERT_ERR(reg_idx <= 6);
    ASSERT_ERR((((uint32_t)rxlnagain << 8) & ~((uint32_t)0x00000300)) == 0);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000300)) | ((uint32_t)rxlnagain << 8));
}

__INLINE uint8_t rpl_rxmix_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 6);
    uint32_t localVal = REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000030)) >> 4);
}

__INLINE void rpl_rxmix_gain_setf(int reg_idx, uint8_t rxmixgain)
{
    ASSERT_ERR(reg_idx <= 6);
    ASSERT_ERR((((uint32_t)rxmixgain << 4) & ~((uint32_t)0x00000030)) == 0);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000030)) | ((uint32_t)rxmixgain << 4));
}

__INLINE uint8_t rpl_rxfilter_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 6);
    uint32_t localVal = REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__INLINE void rpl_rxfilter_gain_setf(int reg_idx, uint8_t rxfiltergain)
{
    ASSERT_ERR(reg_idx <= 6);
    ASSERT_ERR((((uint32_t)rxfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFRXGAINTABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000007)) | ((uint32_t)rxfiltergain << 0));
}

/**
 * @brief RFPOWER_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:28        LDO_RXTX_TRIM   0x0
 *  27:25        LDO_VDIG_TRIM   0x0
 *  24:22        LDO_ADDA_TRIM   0x0
 *  21:19         LDO_VCOMMON_TRIM   0x0
 *  18:16          LDO_XO_TRIM   0x0
 *  15:13         LDO_PLL_TRIM   0x0
 *  12:10        LDO_BGAP_TRIM   0x0
 *     09     LDO_RXTX_LP_MODE   0
 *     08     LDA_ADDA_LP_MODE   0
 *     07      LDO_VCOMMON_LP_MODE   0
 *     06      LDO_PLL_LP_MODE   0
 *     05       LDO_XO_LP_MODE   0
 *     04          LDO_RXTX_ON   0
 *     03          LDO_ADDA_ON   0
 *     02           LDO_VCOMMON_ON   0
 *     01           LDO_PLL_ON   0
 *     00            LDO_XO_ON   1
 * </pre>
 */
#define RPL_RFPOWER_CNTL_ADDR   0x00000048
#define RPL_RFPOWER_CNTL_OFFSET 0x00000048
#define RPL_RFPOWER_CNTL_INDEX  0x00000048
#define RPL_RFPOWER_CNTL_RESET  0x00000001

__INLINE uint32_t rpl_rfpower_cntl_get(void)
{
    return REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
}

__INLINE void rpl_rfpower_cntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, value);
}

