aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_ldo_rxtx_trim_setf(uint8_t ldorxtxtrim)
{
    ASSERT_ERR((((uint32_t)ldorxtxtrim << 28) & ~((uint32_t)0x70000000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x70000000)) | ((uint32_t)ldorxtxtrim << 28));
}

__INLINE uint8_t rpl_ldo_vdig_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x0E000000)) >> 25);
}

__INLINE void rpl_ldo_vdig_trim_setf(uint8_t ldovdigtrim)
{
    ASSERT_ERR((((uint32_t)ldovdigtrim << 25) & ~((uint32_t)0x0E000000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x0E000000)) | ((uint32_t)ldovdigtrim << 25));
}

__INLINE uint8_t rpl_ldo_adda_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x01C00000)) >> 22);
}

__INLINE void rpl_ldo_adda_trim_setf(uint8_t ldoaddatrim)
{
    ASSERT_ERR((((uint32_t)ldoaddatrim << 22) & ~((uint32_t)0x01C00000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x01C00000)) | ((uint32_t)ldoaddatrim << 22));
}

__INLINE uint8_t rpl_ldo_vcommon_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00380000)) >> 19);
}

__INLINE void rpl_ldo_vcommon_trim_setf(uint8_t ldovcotrim)
{
    ASSERT_ERR((((uint32_t)ldovcotrim << 19) & ~((uint32_t)0x00380000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00380000)) | ((uint32_t)ldovcotrim << 19));
}

__INLINE uint8_t rpl_ldo_xo_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00070000)) >> 16);
}

__INLINE void rpl_ldo_xo_trim_setf(uint8_t ldoxotrim)
{
    ASSERT_ERR((((uint32_t)ldoxotrim << 16) & ~((uint32_t)0x00070000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00070000)) | ((uint32_t)ldoxotrim << 16));
}

__INLINE uint8_t rpl_ldo_pll_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000E000)) >> 13);
}

__INLINE void rpl_ldo_pll_trim_setf(uint8_t ldoplltrim)
{
    ASSERT_ERR((((uint32_t)ldoplltrim << 13) & ~((uint32_t)0x0000E000)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x0000E000)) | ((uint32_t)ldoplltrim << 13));
}

__INLINE uint8_t rpl_ldo_bgap_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00001C00)) >> 10);
}

__INLINE void rpl_ldo_bgap_trim_setf(uint8_t ldobgaptrim)
{
    ASSERT_ERR((((uint32_t)ldobgaptrim << 10) & ~((uint32_t)0x00001C00)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00001C00)) | ((uint32_t)ldobgaptrim << 10));
}

__INLINE uint8_t rpl_ldo_rxtx_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void rpl_ldo_rxtx_lp_mode_setf(uint8_t ldorxtxlpmode)
{
    ASSERT_ERR((((uint32_t)ldorxtxlpmode << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)ldorxtxlpmode << 9));
}

__INLINE uint8_t rpl_lda_adda_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void rpl_lda_adda_lp_mode_setf(uint8_t ldaaddalpmode)
{
    ASSERT_ERR((((uint32_t)ldaaddalpmode << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)ldaaddalpmode << 8));
}

__INLINE uint8_t rpl_ldo_vcommon_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void rpl_ldo_vcommon_lp_mode_setf(uint8_t ldovcolpmode)
{
    ASSERT_ERR((((uint32_t)ldovcolpmode << 7) & ~((uint32_t)0x00000080)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000080)) | ((uint32_t)ldovcolpmode << 7));
}

__INLINE uint8_t rpl_ldo_pll_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE void rpl_ldo_pll_lp_mode_setf(uint8_t ldoplllpmode)
{
    ASSERT_ERR((((uint32_t)ldoplllpmode << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)ldoplllpmode << 6));
}

__INLINE uint8_t rpl_ldo_xo_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE void rpl_ldo_xo_lp_mode_setf(uint8_t ldoxolpmode)
{
    ASSERT_ERR((((uint32_t)ldoxolpmode << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)ldoxolpmode << 5));
}

__INLINE uint8_t rpl_ldo_rxtx_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void rpl_ldo_rxtx_on_setf(uint8_t ldorxtxon)
{
    ASSERT_ERR((((uint32_t)ldorxtxon << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)ldorxtxon << 4));
}

__INLINE uint8_t rpl_ldo_adda_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void rpl_ldo_adda_on_setf(uint8_t ldoaddaon)
{
    ASSERT_ERR((((uint32_t)ldoaddaon << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_RFPOWER_CNTL_ADDR, (REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)ldoaddaon << 3));
}

__INLINE uint8_t rpl_ldo_vcommon_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFPOWER_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

