aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_crm_cntl0_pack(uint8_t forceresets, uint8_t forceclockgates, uint8_t daptxdcrsten, uint8_t rpllfdivrsten, uint8_t mdmrsten, uint8_t dbrsten, uint8_t agcrsten, uint8_t sdrsten, uint8_t gfskprefiltrsten, uint8_t dapcalibrsten, uint8_t daprsten, uint8_t daptxdcclkgateen, uint8_t rpllfdivclkgateen, uint8_t saradcclkgateen, uint8_t mdmtxdpsk13clkgateen, uint8_t mdmtxgfsk13clkgateen, uint8_t mdmtx13clkgateen, uint8_t mdmrxdpsk13clkgateen, uint8_t mdmrxdpsk52clkgateen, uint8_t mdmrxdl13clkgateen, uint8_t mdmrxgfsk13clkgateen, uint8_t mdmrxgfsk52clkgateen, uint8_t mdmrx52clkgateen, uint8_t mdmcore13clkgateen, uint8_t dbclkgateen, uint8_t agcclkgateen, uint8_t sdclkgateen, uint8_t gfskprefiltclkgateen, uint8_t dapcalibclkgateen, uint8_t dapclkgateen)
{
    ASSERT_ERR((((uint32_t)forceresets << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)forceclockgates << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)daptxdcrsten << 28) & ~((uint32_t)0x10000000)) == 0);
    ASSERT_ERR((((uint32_t)rpllfdivrsten << 27) & ~((uint32_t)0x08000000)) == 0);
    ASSERT_ERR((((uint32_t)mdmrsten << 26) & ~((uint32_t)0x04000000)) == 0);
    ASSERT_ERR((((uint32_t)dbrsten << 25) & ~((uint32_t)0x02000000)) == 0);
    ASSERT_ERR((((uint32_t)agcrsten << 24) & ~((uint32_t)0x01000000)) == 0);
    ASSERT_ERR((((uint32_t)sdrsten << 23) & ~((uint32_t)0x00800000)) == 0);
    ASSERT_ERR((((uint32_t)gfskprefiltrsten << 22) & ~((uint32_t)0x00400000)) == 0);
    ASSERT_ERR((((uint32_t)dapcalibrsten << 21) & ~((uint32_t)0x00200000)) == 0);
    ASSERT_ERR((((uint32_t)daprsten << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)daptxdcclkgateen << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)rpllfdivclkgateen << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)saradcclkgateen << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)mdmtxdpsk13clkgateen << 15) & ~((uint32_t)0x00008000)) == 0);
    ASSERT_ERR((((uint32_t)mdmtxgfsk13clkgateen << 14) & ~((uint32_t)0x00004000)) == 0);
    ASSERT_ERR((((uint32_t)mdmtx13clkgateen << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxdpsk13clkgateen << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxdpsk52clkgateen << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxdl13clkgateen << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxgfsk13clkgateen << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)mdmrxgfsk52clkgateen << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)mdmrx52clkgateen << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)mdmcore13clkgateen << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)dbclkgateen << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)agcclkgateen << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)sdclkgateen << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)gfskprefiltclkgateen << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dapcalibclkgateen << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)dapclkgateen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR,  ((uint32_t)forceresets << 31) | ((uint32_t)forceclockgates << 30) | ((uint32_t)daptxdcrsten << 28) | ((uint32_t)rpllfdivrsten << 27) | ((uint32_t)mdmrsten << 26) | ((uint32_t)dbrsten << 25) | ((uint32_t)agcrsten << 24) | ((uint32_t)sdrsten << 23) | ((uint32_t)gfskprefiltrsten << 22) | ((uint32_t)dapcalibrsten << 21) | ((uint32_t)daprsten << 20) | ((uint32_t)daptxdcclkgateen << 18) | ((uint32_t)rpllfdivclkgateen << 17) | ((uint32_t)saradcclkgateen << 16) | ((uint32_t)mdmtxdpsk13clkgateen << 15) | ((uint32_t)mdmtxgfsk13clkgateen << 14) | ((uint32_t)mdmtx13clkgateen << 13) | ((uint32_t)mdmrxdpsk13clkgateen << 12) | ((uint32_t)mdmrxdpsk52clkgateen << 11) | ((uint32_t)mdmrxdl13clkgateen << 10) | ((uint32_t)mdmrxgfsk13clkgateen << 9) | ((uint32_t)mdmrxgfsk52clkgateen << 8) | ((uint32_t)mdmrx52clkgateen << 7) | ((uint32_t)mdmcore13clkgateen << 6) | ((uint32_t)dbclkgateen << 5) | ((uint32_t)agcclkgateen << 4) | ((uint32_t)sdclkgateen << 3) | ((uint32_t)gfskprefiltclkgateen << 2) | ((uint32_t)dapcalibclkgateen << 1) | ((uint32_t)dapclkgateen << 0));
}

__INLINE void rpl_crm_cntl0_unpack(uint8_t* forceresets, uint8_t* forceclockgates, uint8_t* daptxdcrsten, uint8_t* rpllfdivrsten, uint8_t* mdmrsten, uint8_t* dbrsten, uint8_t* agcrsten, uint8_t* sdrsten, uint8_t* gfskprefiltrsten, uint8_t* dapcalibrsten, uint8_t* daprsten, uint8_t* daptxdcclkgateen, uint8_t* rpllfdivclkgateen, uint8_t* saradcclkgateen, uint8_t* mdmtxdpsk13clkgateen, uint8_t* mdmtxgfsk13clkgateen, uint8_t* mdmtx13clkgateen, uint8_t* mdmrxdpsk13clkgateen, uint8_t* mdmrxdpsk52clkgateen, uint8_t* mdmrxdl13clkgateen, uint8_t* mdmrxgfsk13clkgateen, uint8_t* mdmrxgfsk52clkgateen, uint8_t* mdmrx52clkgateen, uint8_t* mdmcore13clkgateen, uint8_t* dbclkgateen, uint8_t* agcclkgateen, uint8_t* sdclkgateen, uint8_t* gfskprefiltclkgateen, uint8_t* dapcalibclkgateen, uint8_t* dapclkgateen)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);

    *forceresets = (localVal & ((uint32_t)0x80000000)) >> 31;
    *forceclockgates = (localVal & ((uint32_t)0x40000000)) >> 30;
    *daptxdcrsten = (localVal & ((uint32_t)0x10000000)) >> 28;
    *rpllfdivrsten = (localVal & ((uint32_t)0x08000000)) >> 27;
    *mdmrsten = (localVal & ((uint32_t)0x04000000)) >> 26;
    *dbrsten = (localVal & ((uint32_t)0x02000000)) >> 25;
    *agcrsten = (localVal & ((uint32_t)0x01000000)) >> 24;
    *sdrsten = (localVal & ((uint32_t)0x00800000)) >> 23;
    *gfskprefiltrsten = (localVal & ((uint32_t)0x00400000)) >> 22;
    *dapcalibrsten = (localVal & ((uint32_t)0x00200000)) >> 21;
    *daprsten = (localVal & ((uint32_t)0x00100000)) >> 20;
    *daptxdcclkgateen = (localVal & ((uint32_t)0x00040000)) >> 18;
    *rpllfdivclkgateen = (localVal & ((uint32_t)0x00020000)) >> 17;
    *saradcclkgateen = (localVal & ((uint32_t)0x00010000)) >> 16;
    *mdmtxdpsk13clkgateen = (localVal & ((uint32_t)0x00008000)) >> 15;
    *mdmtxgfsk13clkgateen = (localVal & ((uint32_t)0x00004000)) >> 14;
    *mdmtx13clkgateen = (localVal & ((uint32_t)0x00002000)) >> 13;
    *mdmrxdpsk13clkgateen = (localVal & ((uint32_t)0x00001000)) >> 12;
    *mdmrxdpsk52clkgateen = (localVal & ((uint32_t)0x00000800)) >> 11;
    *mdmrxdl13clkgateen = (localVal & ((uint32_t)0x00000400)) >> 10;
    *mdmrxgfsk13clkgateen = (localVal & ((uint32_t)0x00000200)) >> 9;
    *mdmrxgfsk52clkgateen = (localVal & ((uint32_t)0x00000100)) >> 8;
    *mdmrx52clkgateen = (localVal & ((uint32_t)0x00000080)) >> 7;
    *mdmcore13clkgateen = (localVal & ((uint32_t)0x00000040)) >> 6;
    *dbclkgateen = (localVal & ((uint32_t)0x00000020)) >> 5;
    *agcclkgateen = (localVal & ((uint32_t)0x00000010)) >> 4;
    *sdclkgateen = (localVal & ((uint32_t)0x00000008)) >> 3;
    *gfskprefiltclkgateen = (localVal & ((uint32_t)0x00000004)) >> 2;
    *dapcalibclkgateen = (localVal & ((uint32_t)0x00000002)) >> 1;
    *dapclkgateen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

