aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_force_crm_ctrl_setf(uint8_t forcecrmctrl)
{
    ASSERT_ERR((((uint32_t)forcecrmctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, (REG_RPL_RD(RPL_CRM_CNTL1_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)forcecrmctrl << 31));
}

__INLINE uint8_t rpl_clk_switch_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
    return ((localVal & ((uint32_t)0x03000000)) >> 24);
}

__INLINE void rpl_clk_switch_ctrl_setf(uint8_t clkswitchctrl)
{
    ASSERT_ERR((((uint32_t)clkswitchctrl << 24) & ~((uint32_t)0x03000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, (REG_RPL_RD(RPL_CRM_CNTL1_ADDR) & ~((uint32_t)0x03000000)) | ((uint32_t)clkswitchctrl << 24));
}

__INLINE uint8_t rpl_dpll_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

__INLINE void rpl_dpll_en_setf(uint8_t dpllen)
{
    ASSERT_ERR((((uint32_t)dpllen << 23) & ~((uint32_t)0x00800000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, (REG_RPL_RD(RPL_CRM_CNTL1_ADDR) & ~((uint32_t)0x00800000)) | ((uint32_t)dpllen << 23));
}

__INLINE uint8_t rpl_sar_adc_clk_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void rpl_sar_adc_clk_sel_setf(uint8_t saradcclksel)
{
    ASSERT_ERR((((uint32_t)saradcclksel << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, (REG_RPL_RD(RPL_CRM_CNTL1_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)saradcclksel << 12));
}

__INLINE uint8_t rpl_bb_clk_div_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000300)) >> 8);
}

__INLINE void rpl_bb_clk_div_setf(uint8_t bbclkdiv)
{
    ASSERT_ERR((((uint32_t)bbclkdiv << 8) & ~((uint32_t)0x00000300)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, (REG_RPL_RD(RPL_CRM_CNTL1_ADDR) & ~((uint32_t)0x00000300)) | ((uint32_t)bbclkdiv << 8));
}

__INLINE uint8_t rpl_lp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rpl_lp_mode_setf(uint8_t lpmode)
{
    ASSERT_ERR((((uint32_t)lpmode << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, (REG_RPL_RD(RPL_CRM_CNTL1_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)lpmode << 0));
}

/**
 * @brief RFRXCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         RXCTRL_FORCE   0
 *     30         RXGAIN_FORCE   0
 *     29       FORCE_ADDA_RST   0
 *     25      RSSI_CLK_INV_EN   0
 *     24     RXADC_CLK_INV_EN   0
 *     18       N_LDO_ADDA_RST   0
 *     13      RXADC_SATDET_EN   0
 *     12          MODEM_RX_EN   0
 *     11             RXADC_EN   0
 *     10             RXADC_ON   0
 *     09               AGC_EN   0
 *     08              RSSI_ON   0
 *     07            RXFILT_ON   0
 *     06           RXLOBUF_ON   0
 *     05             RXMIX_ON   0
 *     04             RXLNA_ON   0
 *     03         RXRF_BIAS_ON   0
 *  02:00           RXGAIN_SEL   0x0
 * </pre>
 */
#define RPL_RFRXCNTL_ADDR   0x0000006D
#define RPL_RFRXCNTL_OFFSET 0x0000006D
#define RPL_RFRXCNTL_INDEX  0x0000006D
#define RPL_RFRXCNTL_RESET  0x00000000

__INLINE uint32_t rpl_rfrxcntl_get(void)
{
    return REG_RPL_RD(RPL_RFRXCNTL_ADDR);
}

__INLINE void rpl_rfrxcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, value);
}

// field definitions
#define RPL_RXCTRL_FORCE_BIT        ((uint32_t)0x80000000)
#define RPL_RXCTRL_FORCE_POS        31
#define RPL_RXGAIN_FORCE_BIT        ((uint32_t)0x40000000)
#define RPL_RXGAIN_FORCE_POS        30
#define RPL_FORCE_ADDA_RST_BIT      ((uint32_t)0x20000000)
#define RPL_FORCE_ADDA_RST_POS      29
#define RPL_RSSI_CLK_INV_EN_BIT     ((uint32_t)0x02000000)
#define RPL_RSSI_CLK_INV_EN_POS     25
#define RPL_RXADC_CLK_INV_EN_BIT    ((uint32_t)0x01000000)
#define RPL_RXADC_CLK_INV_EN_POS    24
#define RPL_N_LDO_ADDA_RST_BIT      ((uint32_t)0x00040000)
#define RPL_N_LDO_ADDA_RST_POS      18
#define RPL_RXADC_SATDET_EN_BIT     ((uint32_t)0x00002000)
#define RPL_RXADC_SATDET_EN_POS     13
#define RPL_MODEM_RX_EN_BIT         ((uint32_t)0x00001000)
#define RPL_MODEM_RX_EN_POS         12
#define RPL_RXADC_EN_BIT            ((uint32_t)0x00000800)
#define RPL_RXADC_EN_POS            11
#define RPL_RXADC_ON_BIT            ((uint32_t)0x00000400)
#define RPL_RXADC_ON_POS            10
#define RPL_AGC_EN_BIT              ((uint32_t)0x00000200)
#define RPL_AGC_EN_POS              9
#define RPL_RSSI_ON_BIT             ((uint32_t)0x00000100)
#define RPL_RSSI_ON_POS             8
#define RPL_RXFILT_ON_BIT           ((uint32_t)0x00000080)
#define RPL_RXFILT_ON_POS           7
#define RPL_RXLOBUF_ON_BIT          ((uint32_t)0x00000040)
#define RPL_RXLOBUF_ON_POS          6
#define RPL_RXMIX_ON_BIT            ((uint32_t)0x00000020)
#define RPL_RXMIX_ON_POS            5
#define RPL_RXLNA_ON_BIT            ((uint32_t)0x00000010)
#define RPL_RXLNA_ON_POS            4
#define RPL_RXRF_BIAS_ON_BIT        ((uint32_t)0x00000008)
#define RPL_RXRF_BIAS_ON_POS        3
#define RPL_RXGAIN_SEL_MASK         ((uint32_t)0x00000007)
#define RPL_RXGAIN_SEL_LSB          0
#define RPL_RXGAIN_SEL_WIDTH        ((uint32_t)0x00000003)

#define RPL_RXCTRL_FORCE_RST        0x0
#define RPL_RXGAIN_FORCE_RST        0x0
#define RPL_FORCE_ADDA_RST_RST      0x0
#define RPL_RSSI_CLK_INV_EN_RST     0x0
#define RPL_RXADC_CLK_INV_EN_RST    0x0
#define RPL_N_LDO_ADDA_RST_RST      0x0
#define RPL_RXADC_SATDET_EN_RST     0x0
#define RPL_MODEM_RX_EN_RST         0x0
#define RPL_RXADC_EN_RST            0x0
#define RPL_RXADC_ON_RST            0x0
#define RPL_AGC_EN_RST              0x0
#define RPL_RSSI_ON_RST             0x0
#define RPL_RXFILT_ON_RST           0x0
#define RPL_RXLOBUF_ON_RST          0x0
#define RPL_RXMIX_ON_RST            0x0
#define RPL_RXLNA_ON_RST            0x0
#define RPL_RXRF_BIAS_ON_RST        0x0
#define RPL_RXGAIN_SEL_RST          0x0

__INLINE void rpl_rfrxcntl_pack(uint8_t rxctrlforce, uint8_t rxgainforce, uint8_t forceaddarst, uint8_t rssiclkinven, uint8_t rxadcclkinven, uint8_t nldoaddarst, uint8_t rxadcsatdeten, uint8_t modemrxen, uint8_t rxadcen, uint8_t rxadcon, uint8_t agcen, uint8_t rssion, uint8_t rxfilton, uint8_t rxlobufon, uint8_t rxmixon, uint8_t rxlnaon, uint8_t rxrfbiason, uint8_t rxgainsel)
{
    ASSERT_ERR((((uint32_t)rxctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)rxgainforce << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)forceaddarst << 29) & ~((uint32_t)0x20000000)) == 0);
    ASSERT_ERR((((uint32_t)rssiclkinven << 25) & ~((uint32_t)0x02000000)) == 0);
    ASSERT_ERR((((uint32_t)rxadcclkinven << 24) & ~((uint32_t)0x01000000)) == 0);
    ASSERT_ERR((((uint32_t)nldoaddarst << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)rxadcsatdeten << 13) & ~((uint32_t)0x00002000)) == 0);
    ASSERT_ERR((((uint32_t)modemrxen << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)rxadcen << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)rxadcon << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)agcen << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)rssion << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)rxfilton << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)rxlobufon << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)rxmixon << 5) & ~((uint32_t)0x00000020)) == 0);
    ASSERT_ERR((((uint32_t)rxlnaon << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)rxrfbiason << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)rxgainsel << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR,  ((uint32_t)rxctrlforce << 31) | ((uint32_t)rxgainforce << 30) | ((uint32_t)forceaddarst << 29) | ((uint32_t)rssiclkinven << 25) | ((uint32_t)rxadcclkinven << 24) | ((uint32_t)nldoaddarst << 18) | ((uint32_t)rxadcsatdeten << 13) | ((uint32_t)modemrxen << 12) | ((uint32_t)rxadcen << 11) | ((uint32_t)rxadcon << 10) | ((uint32_t)agcen << 9) | ((uint32_t)rssion << 8) | ((uint32_t)rxfilton << 7) | ((uint32_t)rxlobufon << 6) | ((uint32_t)rxmixon << 5) | ((uint32_t)rxlnaon << 4) | ((uint32_t)rxrfbiason << 3) | ((uint32_t)rxgainsel << 0));
}

