aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_fmtx2p_on_setf(uint8_t fmtx2pon)
{
    ASSERT_ERR((((uint32_t)fmtx2pon << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)fmtx2pon << 18));
}

__INLINE uint8_t rpl_txfiltq_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__INLINE void rpl_txfiltq_on_setf(uint8_t txfiltqon)
{
    ASSERT_ERR((((uint32_t)txfiltqon << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)txfiltqon << 17));
}

__INLINE uint8_t rpl_txfilti_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void rpl_txfilti_on_setf(uint8_t txfiltion)
{
    ASSERT_ERR((((uint32_t)txfiltion << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)txfiltion << 16));
}

__INLINE uint8_t rpl_txdacq_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void rpl_txdacq_on_setf(uint8_t txdacqon)
{
    ASSERT_ERR((((uint32_t)txdacqon << 15) & ~((uint32_t)0x00008000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00008000)) | ((uint32_t)txdacqon << 15));
}

__INLINE uint8_t rpl_txdaci_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

__INLINE void rpl_txdaci_on_setf(uint8_t txdacion)
{
    ASSERT_ERR((((uint32_t)txdacion << 14) & ~((uint32_t)0x00004000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00004000)) | ((uint32_t)txdacion << 14));
}

__INLINE uint8_t rpl_fmtx_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__INLINE void rpl_fmtx_on_setf(uint8_t fmtxon)
{
    ASSERT_ERR((((uint32_t)fmtxon << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)fmtxon << 13));
}

__INLINE uint8_t rpl_txpa_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void rpl_txpa_on_setf(uint8_t txpaon)
{
    ASSERT_ERR((((uint32_t)txpaon << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)txpaon << 12));
}

__INLINE uint8_t rpl_txpa_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE void rpl_txpa_sel_setf(uint8_t txpasel)
{
    ASSERT_ERR((((uint32_t)txpasel << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)txpasel << 11));
}

__INLINE uint8_t rpl_txrf_detect_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__INLINE void rpl_txrf_detect_on_setf(uint8_t txrfdetecton)
{
    ASSERT_ERR((((uint32_t)txrfdetecton << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)txrfdetecton << 10));
}

__INLINE uint8_t rpl_txmix_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void rpl_txmix_on_setf(uint8_t txmixon)
{
    ASSERT_ERR((((uint32_t)txmixon << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)txmixon << 9));
}

__INLINE uint8_t rpl_txlobuf_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void rpl_txlobuf_on_setf(uint8_t txlobufon)
{
    ASSERT_ERR((((uint32_t)txlobufon << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)txlobufon << 8));
}

__INLINE uint8_t rpl_txgain_edr_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__INLINE void rpl_txgain_edr_sel_setf(uint8_t txgainedrsel)
{
    ASSERT_ERR((((uint32_t)txgainedrsel << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)txgainedrsel << 4));
}

__INLINE uint8_t rpl_txgain_gfsk_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

__INLINE void rpl_txgain_gfsk_sel_setf(uint8_t txgaingfsksel)
{
    ASSERT_ERR((((uint32_t)txgaingfsksel << 0) & ~((uint32_t)0x0000000F)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x0000000F)) | ((uint32_t)txgaingfsksel << 0));
}

/**
 * @brief RFTXCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31           TXDC_FORCE   0
 *  12:08               TXDC_Q   0x0
 *  04:00               TXDC_I   0x0
 * </pre>
 */
#define RPL_RFTXCNTL1_ADDR   0x00000070
#define RPL_RFTXCNTL1_OFFSET 0x00000070
#define RPL_RFTXCNTL1_INDEX  0x00000070
#define RPL_RFTXCNTL1_RESET  0x00000000

__INLINE uint32_t rpl_rftxcntl1_get(void)
{
    return REG_RPL_RD(RPL_RFTXCNTL1_ADDR);
}

__INLINE void rpl_rftxcntl1_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR, value);
}

// field definitions
#define RPL_TXDC_FORCE_BIT    ((uint32_t)0x80000000)
#define RPL_TXDC_FORCE_POS    31
#define RPL_TXDC_Q_MASK       ((uint32_t)0x00001F00)
#define RPL_TXDC_Q_LSB        8
#define RPL_TXDC_Q_WIDTH      ((uint32_t)0x00000005)
#define RPL_TXDC_I_MASK       ((uint32_t)0x0000001F)
#define RPL_TXDC_I_LSB        0
#define RPL_TXDC_I_WIDTH      ((uint32_t)0x00000005)

#define RPL_TXDC_FORCE_RST    0x0
#define RPL_TXDC_Q_RST        0x0
#define RPL_TXDC_I_RST        0x0

__INLINE void rpl_rftxcntl1_pack(uint8_t txdcforce, uint8_t txdcq, uint8_t txdci)
{
    ASSERT_ERR((((uint32_t)txdcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)txdcq << 8) & ~((uint32_t)0x00001F00)) == 0);
    ASSERT_ERR((((uint32_t)txdci << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL1_ADDR,  ((uint32_t)txdcforce << 31) | ((uint32_t)txdcq << 8) | ((uint32_t)txdci << 0));
}

__INLINE void rpl_rftxcntl1_unpack(uint8_t* txdcforce, uint8_t* txdcq, uint8_t* txdci)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL1_ADDR);

