aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint8_t rpl_txdc_cal_timeout_delay_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0FF00000)) >> 20);
}

__INLINE void rpl_txdc_cal_timeout_delay_setf(uint8_t txdccaltimeoutdelay)
{
    ASSERT_ERR((((uint32_t)txdccaltimeoutdelay << 20) & ~((uint32_t)0x0FF00000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x0FF00000)) | ((uint32_t)txdccaltimeoutdelay << 20));
}

__INLINE uint8_t rpl_fmtx2p_on_dlyd_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__INLINE void rpl_fmtx2p_on_dlyd_cnt_setf(uint8_t fmtx2pondlydcnt)
{
    ASSERT_ERR((((uint32_t)fmtx2pondlydcnt << 16) & ~((uint32_t)0x000F0000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x000F0000)) | ((uint32_t)fmtx2pondlydcnt << 16));
}

__INLINE uint8_t rpl_fmtx_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0000C000)) >> 14);
}

__INLINE void rpl_fmtx_trim_setf(uint8_t fmtxtrim)
{
    ASSERT_ERR((((uint32_t)fmtxtrim << 14) & ~((uint32_t)0x0000C000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x0000C000)) | ((uint32_t)fmtxtrim << 14));
}

__INLINE uint8_t rpl_txmix_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00003000)) >> 12);
}

__INLINE void rpl_txmix_trim_setf(uint8_t txmixtrim)
{
    ASSERT_ERR((((uint32_t)txmixtrim << 12) & ~((uint32_t)0x00003000)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x00003000)) | ((uint32_t)txmixtrim << 12));
}

__INLINE uint8_t rpl_txtank_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

__INLINE void rpl_txtank_sel_setf(uint8_t txtanksel)
{
    ASSERT_ERR((((uint32_t)txtanksel << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x00000700)) | ((uint32_t)txtanksel << 8));
}

__INLINE uint8_t rpl_txfilt_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__INLINE void rpl_txfilt_cfg_setf(uint8_t txfiltcfg)
{
    ASSERT_ERR((((uint32_t)txfiltcfg << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)txfiltcfg << 4));
}

__INLINE uint8_t rpl_txpa_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__INLINE void rpl_txpa_cfg_setf(uint8_t txpacfg)
{
    ASSERT_ERR((((uint32_t)txpacfg << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXCONFIG_ADDR) & ~((uint32_t)0x00000007)) | ((uint32_t)txpacfg << 0));
}

/**
 * @brief RFTXSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  16:12            TXDCQ_VAL   0x0
 *  08:04            TXDCI_VAL   0x0
 *     01        TXDC_CAL_DEAD   0
 *     00        TXDC_CAL_DONE   0
 * </pre>
 */
#define RPL_RFTXSTAT_ADDR   0x00000072
#define RPL_RFTXSTAT_OFFSET 0x00000072
#define RPL_RFTXSTAT_INDEX  0x00000072
#define RPL_RFTXSTAT_RESET  0x00000000

__INLINE uint32_t rpl_rftxstat_get(void)
{
    return REG_RPL_RD(RPL_RFTXSTAT_ADDR);
}

// field definitions
#define RPL_TXDCQ_VAL_MASK       ((uint32_t)0x0001F000)
#define RPL_TXDCQ_VAL_LSB        12
#define RPL_TXDCQ_VAL_WIDTH      ((uint32_t)0x00000005)
#define RPL_TXDCI_VAL_MASK       ((uint32_t)0x000001F0)
#define RPL_TXDCI_VAL_LSB        4
#define RPL_TXDCI_VAL_WIDTH      ((uint32_t)0x00000005)
#define RPL_TXDC_CAL_DEAD_BIT    ((uint32_t)0x00000002)
#define RPL_TXDC_CAL_DEAD_POS    1
#define RPL_TXDC_CAL_DONE_BIT    ((uint32_t)0x00000001)
#define RPL_TXDC_CAL_DONE_POS    0

#define RPL_TXDCQ_VAL_RST        0x0
#define RPL_TXDCI_VAL_RST        0x0
#define RPL_TXDC_CAL_DEAD_RST    0x0
#define RPL_TXDC_CAL_DONE_RST    0x0

__INLINE void rpl_rftxstat_unpack(uint8_t* txdcqval, uint8_t* txdcival, uint8_t* txdccaldead, uint8_t* txdccaldone)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);

    *txdcqval = (localVal & ((uint32_t)0x0001F000)) >> 12;
    *txdcival = (localVal & ((uint32_t)0x000001F0)) >> 4;
    *txdccaldead = (localVal & ((uint32_t)0x00000002)) >> 1;
    *txdccaldone = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_txdcq_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0001F000)) >> 12);
}

__INLINE uint8_t rpl_txdci_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000001F0)) >> 4);
}

__INLINE uint8_t rpl_txdc_cal_dead_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t rpl_txdc_cal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief RFTXRXCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31       TXRXCTRL_FORCE   0
 *     30   VCOFC_ICP_CAL_FORCE   0
 *     12   VCOFC_CAL_ICP_MODE   0
 *     09      RXMDM_BYPASS_EN   0
 *     08      TXMDM_BYPASS_EN   0
 *     06   RFPLL_CAL_TIMEOUT_DSB   0
 *     05        ICP_CAL_START   0
 *     04      VCOFC_CAL_START   0
 *     02                PD_ON   0
 *     01           BB_BIAS_ON   0
 *     00            LODIV2_ON   0
 * </pre>
 */
#define RPL_RFTXRXCNTL_ADDR   0x00000073
#define RPL_RFTXRXCNTL_OFFSET 0x00000073
#define RPL_RFTXRXCNTL_INDEX  0x00000073
#define RPL_RFTXRXCNTL_RESET  0x00000000

__INLINE uint32_t rpl_rftxrxcntl_get(void)
{
    return REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
}

__INLINE void rpl_rftxrxcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, value);
}

