aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint8_t rpl_vcofc_cal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief SAR_ADC_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31        SAR_ADC_FORCE   0
 *  07:04          SAR_ADC_SEL   0x0
 *     02         SAR_ADC_MODE   0
 *     01        SAR_ADC_START   0
 *     00           SAR_ADC_ON   0
 * </pre>
 */
#define RPL_SAR_ADC_CNTL_ADDR   0x00000076
#define RPL_SAR_ADC_CNTL_OFFSET 0x00000076
#define RPL_SAR_ADC_CNTL_INDEX  0x00000076
#define RPL_SAR_ADC_CNTL_RESET  0x00000000

__INLINE uint32_t rpl_sar_adc_cntl_get(void)
{
    return REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
}

__INLINE void rpl_sar_adc_cntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, value);
}

// field definitions
#define RPL_SAR_ADC_FORCE_BIT    ((uint32_t)0x80000000)
#define RPL_SAR_ADC_FORCE_POS    31
#define RPL_SAR_ADC_SEL_MASK     ((uint32_t)0x000000F0)
#define RPL_SAR_ADC_SEL_LSB      4
#define RPL_SAR_ADC_SEL_WIDTH    ((uint32_t)0x00000004)
#define RPL_SAR_ADC_MODE_BIT     ((uint32_t)0x00000004)
#define RPL_SAR_ADC_MODE_POS     2
#define RPL_SAR_ADC_START_BIT    ((uint32_t)0x00000002)
#define RPL_SAR_ADC_START_POS    1
#define RPL_SAR_ADC_ON_BIT       ((uint32_t)0x00000001)
#define RPL_SAR_ADC_ON_POS       0

#define RPL_SAR_ADC_FORCE_RST    0x0
#define RPL_SAR_ADC_SEL_RST      0x0
#define RPL_SAR_ADC_MODE_RST     0x0
#define RPL_SAR_ADC_START_RST    0x0
#define RPL_SAR_ADC_ON_RST       0x0

__INLINE void rpl_sar_adc_cntl_pack(uint8_t saradcforce, uint8_t saradcsel, uint8_t saradcmode, uint8_t saradcstart, uint8_t saradcon)
{
    ASSERT_ERR((((uint32_t)saradcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)saradcsel << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)saradcmode << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)saradcstart << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)saradcon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR,  ((uint32_t)saradcforce << 31) | ((uint32_t)saradcsel << 4) | ((uint32_t)saradcmode << 2) | ((uint32_t)saradcstart << 1) | ((uint32_t)saradcon << 0));
}

__INLINE void rpl_sar_adc_cntl_unpack(uint8_t* saradcforce, uint8_t* saradcsel, uint8_t* saradcmode, uint8_t* saradcstart, uint8_t* saradcon)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);

    *saradcforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *saradcsel = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *saradcmode = (localVal & ((uint32_t)0x00000004)) >> 2;
    *saradcstart = (localVal & ((uint32_t)0x00000002)) >> 1;
    *saradcon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_sar_adc_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_sar_adc_force_setf(uint8_t saradcforce)
{
    ASSERT_ERR((((uint32_t)saradcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)saradcforce << 31));
}

__INLINE uint8_t rpl_sar_adc_sel_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__INLINE void rpl_sar_adc_sel_setf(uint8_t saradcsel)
{
    ASSERT_ERR((((uint32_t)saradcsel << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)saradcsel << 4));
}

__INLINE uint8_t rpl_sar_adc_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void rpl_sar_adc_mode_setf(uint8_t saradcmode)
{
    ASSERT_ERR((((uint32_t)saradcmode << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)saradcmode << 2));
}

__INLINE uint8_t rpl_sar_adc_start_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void rpl_sar_adc_start_setf(uint8_t saradcstart)
{
    ASSERT_ERR((((uint32_t)saradcstart << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)saradcstart << 1));
}

__INLINE uint8_t rpl_sar_adc_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rpl_sar_adc_on_setf(uint8_t saradcon)
{
    ASSERT_ERR((((uint32_t)saradcon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, (REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)saradcon << 0));
}

/**
 * @brief SAR_ADC_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         SAR_ADC_DONE   0
 *  09:00          SAR_ADC_VAL   0x0
 * </pre>
 */
#define RPL_SAR_ADC_STAT_ADDR   0x00000077
#define RPL_SAR_ADC_STAT_OFFSET 0x00000077
#define RPL_SAR_ADC_STAT_INDEX  0x00000077
#define RPL_SAR_ADC_STAT_RESET  0x00000000

__INLINE uint32_t rpl_sar_adc_stat_get(void)
{
    return REG_RPL_RD(RPL_SAR_ADC_STAT_ADDR);
}

// field definitions
#define RPL_SAR_ADC_DONE_BIT    ((uint32_t)0x80000000)
#define RPL_SAR_ADC_DONE_POS    31
#define RPL_SAR_ADC_VAL_MASK    ((uint32_t)0x000003FF)
#define RPL_SAR_ADC_VAL_LSB     0
#define RPL_SAR_ADC_VAL_WIDTH   ((uint32_t)0x0000000A)

#define RPL_SAR_ADC_DONE_RST    0x0
#define RPL_SAR_ADC_VAL_RST     0x0

__INLINE void rpl_sar_adc_stat_unpack(uint8_t* saradcdone, uint16_t* saradcval)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_STAT_ADDR);

    *saradcdone = (localVal & ((uint32_t)0x80000000)) >> 31;
    *saradcval = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint8_t rpl_sar_adc_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_STAT_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

