aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint16_t rpl_sar_adc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_STAT_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

/**
 * @brief RXADC_SATDET_CONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:30    RXADC_SATDET_MODE   0x2
 *  14:08     RXADC_SATDET_THR   0x14
 *  06:00   RXADC_SATDET_WINDOW   0x40
 * </pre>
 */
#define RPL_RXADC_SATDET_CONFIG_ADDR   0x00000078
#define RPL_RXADC_SATDET_CONFIG_OFFSET 0x00000078
#define RPL_RXADC_SATDET_CONFIG_INDEX  0x00000078
#define RPL_RXADC_SATDET_CONFIG_RESET  0x80001440

__INLINE uint32_t rpl_rxadc_satdet_config_get(void)
{
    return REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);
}

__INLINE void rpl_rxadc_satdet_config_set(uint32_t value)
{
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR, value);
}

// field definitions
#define RPL_RXADC_SATDET_MODE_MASK     ((uint32_t)0xC0000000)
#define RPL_RXADC_SATDET_MODE_LSB      30
#define RPL_RXADC_SATDET_MODE_WIDTH    ((uint32_t)0x00000002)
#define RPL_RXADC_SATDET_THR_MASK      ((uint32_t)0x00007F00)
#define RPL_RXADC_SATDET_THR_LSB       8
#define RPL_RXADC_SATDET_THR_WIDTH     ((uint32_t)0x00000007)
#define RPL_RXADC_SATDET_WINDOW_MASK   ((uint32_t)0x0000007F)
#define RPL_RXADC_SATDET_WINDOW_LSB    0
#define RPL_RXADC_SATDET_WINDOW_WIDTH  ((uint32_t)0x00000007)

#define RPL_RXADC_SATDET_MODE_RST      0x2
#define RPL_RXADC_SATDET_THR_RST       0x14
#define RPL_RXADC_SATDET_WINDOW_RST    0x40

__INLINE void rpl_rxadc_satdet_config_pack(uint8_t rxadcsatdetmode, uint8_t rxadcsatdetthr, uint8_t rxadcsatdetwindow)
{
    ASSERT_ERR((((uint32_t)rxadcsatdetmode << 30) & ~((uint32_t)0xC0000000)) == 0);
    ASSERT_ERR((((uint32_t)rxadcsatdetthr << 8) & ~((uint32_t)0x00007F00)) == 0);
    ASSERT_ERR((((uint32_t)rxadcsatdetwindow << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR,  ((uint32_t)rxadcsatdetmode << 30) | ((uint32_t)rxadcsatdetthr << 8) | ((uint32_t)rxadcsatdetwindow << 0));
}

__INLINE void rpl_rxadc_satdet_config_unpack(uint8_t* rxadcsatdetmode, uint8_t* rxadcsatdetthr, uint8_t* rxadcsatdetwindow)
{
    uint32_t localVal = REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);

    *rxadcsatdetmode = (localVal & ((uint32_t)0xC0000000)) >> 30;
    *rxadcsatdetthr = (localVal & ((uint32_t)0x00007F00)) >> 8;
    *rxadcsatdetwindow = (localVal & ((uint32_t)0x0000007F)) >> 0;
}

__INLINE uint8_t rpl_rxadc_satdet_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0xC0000000)) >> 30);
}

__INLINE void rpl_rxadc_satdet_mode_setf(uint8_t rxadcsatdetmode)
{
    ASSERT_ERR((((uint32_t)rxadcsatdetmode << 30) & ~((uint32_t)0xC0000000)) == 0);
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR, (REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR) & ~((uint32_t)0xC0000000)) | ((uint32_t)rxadcsatdetmode << 30));
}

__INLINE uint8_t rpl_rxadc_satdet_thr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00007F00)) >> 8);
}

__INLINE void rpl_rxadc_satdet_thr_setf(uint8_t rxadcsatdetthr)
{
    ASSERT_ERR((((uint32_t)rxadcsatdetthr << 8) & ~((uint32_t)0x00007F00)) == 0);
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR, (REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR) & ~((uint32_t)0x00007F00)) | ((uint32_t)rxadcsatdetthr << 8));
}

__INLINE uint8_t rpl_rxadc_satdet_window_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0000007F)) >> 0);
}

__INLINE void rpl_rxadc_satdet_window_setf(uint8_t rxadcsatdetwindow)
{
    ASSERT_ERR((((uint32_t)rxadcsatdetwindow << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_RPL_WR(RPL_RXADC_SATDET_CONFIG_ADDR, (REG_RPL_RD(RPL_RXADC_SATDET_CONFIG_ADDR) & ~((uint32_t)0x0000007F)) | ((uint32_t)rxadcsatdetwindow << 0));
}

/**
 * @brief TXDC_DETECT_CONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31            TXDC_MODE   0
 *  25:16       TXDC_REF_VALUE   0x26E
 *  07:00     TXDC_SETTLE_TIME   0x17
 * </pre>
 */
#define RPL_TXDC_DETECT_CONFIG_ADDR   0x00000079
#define RPL_TXDC_DETECT_CONFIG_OFFSET 0x00000079
#define RPL_TXDC_DETECT_CONFIG_INDEX  0x00000079
#define RPL_TXDC_DETECT_CONFIG_RESET  0x026E0017

__INLINE uint32_t rpl_txdc_detect_config_get(void)
{
    return REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);
}

__INLINE void rpl_txdc_detect_config_set(uint32_t value)
{
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR, value);
}

// field definitions
#define RPL_TXDC_MODE_BIT           ((uint32_t)0x80000000)
#define RPL_TXDC_MODE_POS           31
#define RPL_TXDC_REF_VALUE_MASK     ((uint32_t)0x03FF0000)
#define RPL_TXDC_REF_VALUE_LSB      16
#define RPL_TXDC_REF_VALUE_WIDTH    ((uint32_t)0x0000000A)
#define RPL_TXDC_SETTLE_TIME_MASK   ((uint32_t)0x000000FF)
#define RPL_TXDC_SETTLE_TIME_LSB    0
#define RPL_TXDC_SETTLE_TIME_WIDTH  ((uint32_t)0x00000008)

#define RPL_TXDC_MODE_RST           0x0
#define RPL_TXDC_REF_VALUE_RST      0x26E
#define RPL_TXDC_SETTLE_TIME_RST    0x17

__INLINE void rpl_txdc_detect_config_pack(uint8_t txdcmode, uint16_t txdcrefvalue, uint8_t txdcsettletime)
{
    ASSERT_ERR((((uint32_t)txdcmode << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)txdcrefvalue << 16) & ~((uint32_t)0x03FF0000)) == 0);
    ASSERT_ERR((((uint32_t)txdcsettletime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR,  ((uint32_t)txdcmode << 31) | ((uint32_t)txdcrefvalue << 16) | ((uint32_t)txdcsettletime << 0));
}

__INLINE void rpl_txdc_detect_config_unpack(uint8_t* txdcmode, uint16_t* txdcrefvalue, uint8_t* txdcsettletime)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);

    *txdcmode = (localVal & ((uint32_t)0x80000000)) >> 31;
    *txdcrefvalue = (localVal & ((uint32_t)0x03FF0000)) >> 16;
    *txdcsettletime = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

