aozima/bk7231_rtt_sdk/beken378/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint8_t rpl_txdc_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_txdc_mode_setf(uint8_t txdcmode)
{
    ASSERT_ERR((((uint32_t)txdcmode << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR, (REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txdcmode << 31));
}

__INLINE uint16_t rpl_txdc_ref_value_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x03FF0000)) >> 16);
}

__INLINE void rpl_txdc_ref_value_setf(uint16_t txdcrefvalue)
{
    ASSERT_ERR((((uint32_t)txdcrefvalue << 16) & ~((uint32_t)0x03FF0000)) == 0);
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR, (REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR) & ~((uint32_t)0x03FF0000)) | ((uint32_t)txdcrefvalue << 16));
}

__INLINE uint8_t rpl_txdc_settle_time_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_txdc_settle_time_setf(uint8_t txdcsettletime)
{
    ASSERT_ERR((((uint32_t)txdcsettletime << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_TXDC_DETECT_CONFIG_ADDR, (REG_RPL_RD(RPL_TXDC_DETECT_CONFIG_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)txdcsettletime << 0));
}

/**
 * @brief TESTMUXCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08            MUX1_CTRL   0x1
 *  07:00            MUX0_CTRL   0x0
 * </pre>
 */
#define RPL_TESTMUXCNTL_ADDR   0x0000007A
#define RPL_TESTMUXCNTL_OFFSET 0x0000007A
#define RPL_TESTMUXCNTL_INDEX  0x0000007A
#define RPL_TESTMUXCNTL_RESET  0x00000100

__INLINE uint32_t rpl_testmuxcntl_get(void)
{
    return REG_RPL_RD(RPL_TESTMUXCNTL_ADDR);
}

__INLINE void rpl_testmuxcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_TESTMUXCNTL_ADDR, value);
}

// field definitions
#define RPL_MUX1_CTRL_MASK   ((uint32_t)0x0000FF00)
#define RPL_MUX1_CTRL_LSB    8
#define RPL_MUX1_CTRL_WIDTH  ((uint32_t)0x00000008)
#define RPL_MUX0_CTRL_MASK   ((uint32_t)0x000000FF)
#define RPL_MUX0_CTRL_LSB    0
#define RPL_MUX0_CTRL_WIDTH  ((uint32_t)0x00000008)

#define RPL_MUX1_CTRL_RST    0x1
#define RPL_MUX0_CTRL_RST    0x0

__INLINE void rpl_testmuxcntl_pack(uint8_t mux1ctrl, uint8_t mux0ctrl)
{
    ASSERT_ERR((((uint32_t)mux1ctrl << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)mux0ctrl << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_TESTMUXCNTL_ADDR,  ((uint32_t)mux1ctrl << 8) | ((uint32_t)mux0ctrl << 0));
}

__INLINE void rpl_testmuxcntl_unpack(uint8_t* mux1ctrl, uint8_t* mux0ctrl)
{
    uint32_t localVal = REG_RPL_RD(RPL_TESTMUXCNTL_ADDR);

    *mux1ctrl = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *mux0ctrl = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rpl_mux1_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TESTMUXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE void rpl_mux1_ctrl_setf(uint8_t mux1ctrl)
{
    ASSERT_ERR((((uint32_t)mux1ctrl << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_TESTMUXCNTL_ADDR, (REG_RPL_RD(RPL_TESTMUXCNTL_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)mux1ctrl << 8));
}

__INLINE uint8_t rpl_mux0_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_TESTMUXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_mux0_ctrl_setf(uint8_t mux0ctrl)
{
    ASSERT_ERR((((uint32_t)mux0ctrl << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_TESTMUXCNTL_ADDR, (REG_RPL_RD(RPL_TESTMUXCNTL_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)mux0ctrl << 0));
}

/**
 * @brief PAD_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16          DRVSTR_CNTL   0x0
 *  15:08          PULLDN_CNTL   0x0
 *  07:00          PULLUP_CNTL   0x0
 * </pre>
 */
#define RPL_PAD_CNTL_ADDR   0x0000007B
#define RPL_PAD_CNTL_OFFSET 0x0000007B
#define RPL_PAD_CNTL_INDEX  0x0000007B
#define RPL_PAD_CNTL_RESET  0x00000000

__INLINE uint32_t rpl_pad_cntl_get(void)
{
    return REG_RPL_RD(RPL_PAD_CNTL_ADDR);
}

__INLINE void rpl_pad_cntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_PAD_CNTL_ADDR, value);
}

// field definitions
#define RPL_DRVSTR_CNTL_MASK   ((uint32_t)0x00FF0000)
#define RPL_DRVSTR_CNTL_LSB    16
#define RPL_DRVSTR_CNTL_WIDTH  ((uint32_t)0x00000008)
#define RPL_PULLDN_CNTL_MASK   ((uint32_t)0x0000FF00)
#define RPL_PULLDN_CNTL_LSB    8
#define RPL_PULLDN_CNTL_WIDTH  ((uint32_t)0x00000008)
#define RPL_PULLUP_CNTL_MASK   ((uint32_t)0x000000FF)
#define RPL_PULLUP_CNTL_LSB    0
#define RPL_PULLUP_CNTL_WIDTH  ((uint32_t)0x00000008)

#define RPL_DRVSTR_CNTL_RST    0x0
#define RPL_PULLDN_CNTL_RST    0x0
#define RPL_PULLUP_CNTL_RST    0x0

__INLINE void rpl_pad_cntl_pack(uint8_t drvstrcntl, uint8_t pulldncntl, uint8_t pullupcntl)
{
    ASSERT_ERR((((uint32_t)drvstrcntl << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)pulldncntl << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)pullupcntl << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_PAD_CNTL_ADDR,  ((uint32_t)drvstrcntl << 16) | ((uint32_t)pulldncntl << 8) | ((uint32_t)pullupcntl << 0));
}

__INLINE void rpl_pad_cntl_unpack(uint8_t* drvstrcntl, uint8_t* pulldncntl, uint8_t* pullupcntl)
{
    uint32_t localVal = REG_RPL_RD(RPL_PAD_CNTL_ADDR);

    *drvstrcntl = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *pulldncntl = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *pullupcntl = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t rpl_drvstr_cntl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PAD_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rpl_drvstr_cntl_setf(uint8_t drvstrcntl)
{
    ASSERT_ERR((((uint32_t)drvstrcntl << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_RPL_WR(RPL_PAD_CNTL_ADDR, (REG_RPL_RD(RPL_PAD_CNTL_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)drvstrcntl << 16));
}

__INLINE uint8_t rpl_pulldn_cntl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PAD_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE void rpl_pulldn_cntl_setf(uint8_t pulldncntl)
{
    ASSERT_ERR((((uint32_t)pulldncntl << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_PAD_CNTL_ADDR, (REG_RPL_RD(RPL_PAD_CNTL_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)pulldncntl << 8));
}

__INLINE uint8_t rpl_pullup_cntl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_PAD_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_pullup_cntl_setf(uint8_t pullupcntl)
{
    ASSERT_ERR((((uint32_t)pullupcntl << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_PAD_CNTL_ADDR, (REG_RPL_RD(RPL_PAD_CNTL_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)pullupcntl << 0));
}

/**
 * @brief SPARE_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            SPARE_OUT   0x0
 * </pre>
 */
#define RPL_SPARE_CNTL_ADDR   0x0000007C
#define RPL_SPARE_CNTL_OFFSET 0x0000007C
#define RPL_SPARE_CNTL_INDEX  0x0000007C
#define RPL_SPARE_CNTL_RESET  0x00000000

__INLINE uint32_t rpl_spare_cntl_get(void)
{
    return REG_RPL_RD(RPL_SPARE_CNTL_ADDR);
}

__INLINE void rpl_spare_cntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_SPARE_CNTL_ADDR, value);
}

// field definitions
#define RPL_SPARE_OUT_MASK   ((uint32_t)0xFFFFFFFF)
#define RPL_SPARE_OUT_LSB    0
#define RPL_SPARE_OUT_WIDTH  ((uint32_t)0x00000020)

#define RPL_SPARE_OUT_RST    0x0

__INLINE uint32_t rpl_spare_out_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SPARE_CNTL_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void rpl_spare_out_setf(uint32_t spareout)
{
    ASSERT_ERR((((uint32_t)spareout << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_RPL_WR(RPL_SPARE_CNTL_ADDR, (uint32_t)spareout << 0);
}

/**
 * @brief SPARE_STAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             SPARE_IN   0x0
 * </pre>
 */
#define RPL_SPARE_STAT_ADDR   0x0000007D
#define RPL_SPARE_STAT_OFFSET 0x0000007D
#define RPL_SPARE_STAT_INDEX  0x0000007D
#define RPL_SPARE_STAT_RESET  0x00000000

__INLINE uint32_t rpl_spare_stat_get(void)
{
    return REG_RPL_RD(RPL_SPARE_STAT_ADDR);
}

// field definitions
#define RPL_SPARE_IN_MASK   ((uint32_t)0xFFFFFFFF)
#define RPL_SPARE_IN_LSB    0
#define RPL_SPARE_IN_WIDTH  ((uint32_t)0x00000020)

#define RPL_SPARE_IN_RST    0x0

__INLINE uint32_t rpl_spare_in_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SPARE_STAT_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}


#endif // _REG_RIPPLE_H_

